app/Controllers/Timx.php

    public function index()
    {
        $model = new TimModel();

        $data = [
            'tims' => $model->paginate(3),
            'pager' => $model->pager
        ];
---
SELECT *
FROM `tim`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `tim`